1. Создать репозиторий на GitHub
2. Нарисовать блок-схему алгоритма (можно обойтись блок-схемой основной содержательной части, если вы выделяете её в отдельный метод)
3. Снабдить репозиторий оформленным текстовым описанием решения (файл README.md)
4. Написать программу, решающую поставленную задачу
5. Использовать контроль версий в работе над этим небольшим проектом (не должно быть так, что всё залито одним коммитом, как минимум этапы 2, 3, и 4 должны быть расположены в разных коммитах)

## Задача: 
Написать программу, которая из имеющегося массива строк формирует новый массив из строк, длина которых меньше, либо равна 3 символам. Первоначальный массив можно ввести с клавиатуры, либо задать на старте выполнения алгоритма. При решении не рекомендуется пользоваться коллекциями, лучше обойтись исключительно массивами.

### Примеры:
[“Hello”, “2”, “world”, “:-)”] → [“2”, “:-)”]
[“1234”, “1567”, “-2”, “computer science”] → [“-2”]
[“Russia”, “Denmark”, “Kazan”] → []

### Описание решения задачи:

* Создаём метод PrintArray для вывода значений массива.
* C помощью size, задаём размер массива. 
* Объявляем массив arrayStrings.
* Циклом for (int i = 0; i < size; i++) наполняем массив значениями, которые вводим с клавиатуры.
* Объявляем массив arrayFinal, такой же длины как и arrayStrings.
* Объявляем две переменные length и count.
* Выполняем цикл for (int i = 0; i < size; i++).
* Цикл выполняется столько раз, сколько элементов в массиве, при этом проверяется условие: if (arrayStrings[i].Length <= length), в котором проверяется сколько символов в текущем элементе массива, и если количество символов меньше или равно заданному количеству length, то значение записывается в элемент массива. 
* Делаем отступ строки Console.WriteLine() и методом PrintArray выводим массив arrayFinal на экран.
